void Draw() {  // อันนี้เป็นฟังก์ชั่นที่จะวาดmapของเกมขึ้นมา
    system("cls"); //บรรทัดนี้คือการทำให้ terminal มันลบหน้าเก่าออกก่อนที่จะสร้างหน้าใหม่ขึ้นมา เลยเกิดภาพเป็นframeๆแบบดูง่ายๆ
    for (int i = 0; i < width + 2; i++)//อันนี้คือวาดรั้วด้านบน ที่ต้อเป็นwidth+2เป็นเพราะเราให้ข้างในที่งูวิ่งได้คือ20*20แล้วรั้วให้คลอบ20นั้นอีกทีมันเลยกลายเป็น22ช่อง
        cout << "#";
    cout << endl;

    for (int i = 0; i < height; i++) { // อันนี้คือการวาดพื้นที่ด้านใน20*20 i = แกน y ,j = แกนx
        for (int j = 0; j < width; j++) {
            if (j == 0)//อันนี้คือการวาดรั้วด้านซ้าย ไม่อยู่ในพื้นที่20*20เพราะเป็นฟังชั่นifคนละอันกัน
                cout << "#";
    //-----------------------------------------------------
            if (i == y && j == x)//อันนี้คือการเช็คว่าตอนนี้เรารันจนถึงจุดที่หัวงูอยู่รึยังถ้าใช้ให้พิมพ์Oที่เป็นหัวงูตรงนั้นออกมา
                cout << "O";
            else if (i == fruitY && j == fruitX)//อันนี้วาดผลไม้ธรรมดา
                cout << "F";
            else if (i == boostFruitY && j == boostFruitX)//อันนี้วาดผลไม้บูส
                cout << "B";
            else if (i == poisonFruitY && j == poisonFruitX)//อันนี้วาดผลไม้พิษ
                cout << "P";
            else if (i == fatFruitY && j == fatFruitX)//อันนี้วาดผลไม้ตัว+2
                cout << "A";
            else if (i == reverseFruitY && j == reverseFruitX)//อันนี้วาดผลไม้มึน
                cout << "R";
            else if (i == MinusFruitY && j == MinusFruitX)
                cout << "M";
            else {  //อันนี้คือถ้ามันตั้งแต่บรรทัดที่51ถึง61แล้วไม่ตรงเลยให้พิมพ์หางไม่ก็" "
                bool printtail = false;//ตรงนี้เราจะเซ็ตตัวแปรสำหรับบอกไอ่สเปสบาร์ว่าเห้ยกูปริ้นหางละนะ ไม่ต้องปริ้นสเปสอีกตัว
                for (int k = 0; k < nTail; k++) { //อันนี้คือเช็คว่าตอนนี้งูมีกี่หางจะได้ปริ้นหางออกมาตามนั้น
                    if (tailX[k] == j && tailY[k] == i) {//ตรงนี้คเช็คว่าจุดที่โปรแกรมรันถึงใช่ตำแหน่งของหางมั้ยถ้าใช่ให้ปริ้นoละเปลี่ยนprinttailเป็นtrue
                        cout << "o";
                        printtail = true;
                    }
                }
                if (!printtail)//ตรงนี้มีไว้ปริ้นสเปสบาร์ถ้ามันไม่ได้ปริ้นหาง ถ้ามันปริ้นหางตรงนี้จะกลายเป็นfalseแล้วจะskipไป
                    cout << " ";
            }
    //----------------------------------------------------
            if (j == width - 1)//อันนี้คือการวาดรั้วด้านขวา ไม่อยู่ในพื้นที่20*20เพราะเป็นฟังชั่นifคนละอันกัน
                cout << "#";
        }
        cout << endl;
    }

    for (int i = 0; i < width + 2; i++)//อันนี้คือวาดรั้วด้านล่าง
        cout << "#";
    cout << endl;
    cout << "Score:" << score << endl;//อันนี้เอาไว้โชว์score
}